facts = [
    {
        'text': '130-й квартал — это историческая зона Иркутска, восстановленная с любовью к архитектуре.',
        'image': 'images/kvartal130.jpg'
    },
    {
        'text': 'Иркутск — город в России, административный центр Иркутской области, образует отдельное '
                'муниципальное образование Иркутск со статусом городского округа как единственный '
                'населённый пункт в его составе.',
        'image': 'images/irkutsk.jpg'
    },
    {
        'text': 'Население города — 611 215 (2023) человек, шестой по численности населения город Сибири, '
                'двадцать пятый по численности населения город России.',
        'image': 'images/population.jpg'
    },
    {
        'text': 'Иркутск расположен в Восточной Сибири, на берегах реки Ангары, при впадении в неё реки Иркут, '
                'в 66 км от Байкала.',
        'image': 'images/map_location.jpg'
    },
    {
        'text': 'Иркутск — это крупный научно-образовательный центр, в котором обучается свыше ста тысяч студентов.',
        'image': 'images/students.jpg'
    },
    {
        'text': 'Иркустк — транспортный узел на Транссибирской железнодорожной магистрали и федеральных '
                'автомагистралях «Байкал» и «Сибирь».',
        'image': 'images/transsib.jpg'
    },
    {
        'text': 'Старинный сибирский город Иркутск основан как острог в 1661 году.',
        'image': 'images/ostrog.jpg'
    },
    {
        'text': 'Площадь у города Иркутска составляет 305 км2',
        'image': 'images/square_map.jpg'
    },
    {
        'text': 'Говорин Борис Александрович был первым мэром Иркутска.',
        'image': 'images/govorin.jpg'
    },
    {
        'text': 'Похабов Яков Иванович основал Иркутск в 1661 году.',
        'image': 'images/pohabov.jpg'
    },
    {
        'text': 'Иркутская область относится к самым солнечным регионам. В году 200-250 солнечных дней.',
        'image': 'images/sunny_days.jpg'
    },
    {
        'text': 'Герб Иркутска, утверждённый в 1997 году, представляет собой серебряный геральдический щит, '
                'на котором изображён чёрный «бабр» с червлёными глазами, держащий в пасти червлёного соболя',
        'image': 'images/coat_of_arms.jpg'
    },
    {
        'text': 'Первое каменное здание — приказная изба появилась в 1701 году.',
        'image': 'images/prikaznaya_izba.jpg'
    },
    {
        'text': 'В 1764 году образована Иркутская губерния в составе Сибирского царства',
        'image': 'images/guberniya.jpg'
    },
    {
        'text': 'В 2020 году городу было присвоено звание «Город трудовой доблести».',
        'image': 'images/labor_valor.jpg'
    },
    {
        'text': 'Город Иркутск — важный административный, экономический, транспортный, научный и культурный '
                'центр Восточной Сибири, областной центр Иркутской области',
        'image': 'images/city_center.jpg'
    },
    {
        'text': 'В июне 1879 года город сильно пострадал от пожаров: выгорела почти вся его центральная часть, '
                'было уничтожено более двух третей городских построек, 75 кварталов. Однако Иркутск сравнительно '
                'быстро восстановился, приобретя новый, более современный вид.',
        'image': 'images/fire_1879.jpg'
    },
    {
        'text': 'Знаменский собор монастыря построен в 1757-1762 годах в традициях иркутской школы сибирского барокко. '
                'К основному храму примыкают обширная трапезная и восьмигранная колокольня.',
        'image': 'images/znamensky.jpg'
    },
    {
        'text': 'До 1932 года в Иркутске находился главный храм — Казанский собор, построенный в византийском стиле. '
                'Собор был заложен в 1875 году, строительные работы велись в течение многих лет и были закончены '
                'в 1895 году.\nИркутский кафедральный собор входил в число крупнейших культовых сооружений России. '
                'Он вмещал 5 000 человек, его высота достигала 60 метров. Архитектурные достоинства храма высоко '
                'оценивались современниками.\nВ 1932 году здание Казанского собора было взорвано.',
        'image': 'images/kazansky.jpg'
    },
    {
        'text': 'Иркутский областной художественный музей — один из крупнейших в регионе. Основу его собрания '
                'составила коллекция картин, икон и других произведений искусства, подаренных городу иркутским купцом, '
                'городским головой Сукачевым.\nДо 1917 года в этом здании находилась Иркутская мужская гимназия, '
                'основанная в 1805 году.',
        'image': 'images/art_museum.jpg'
    },
    {
        'text': 'До революции Иркутск часто называли «Сибирскими Афинами», «Восточным Парижем» и «Петербургом Сибири».',
        'image': 'images/paris.jpg'
    },
    {
        'text': 'Первоначально Транссибирскую магистраль предполагалось проложить по более короткому пути к северу от '
                'Байкала, однако Иркутску повезло, и в 1898 году туда прибыл первый поезд.',
        'image': 'images/train_arrival.jpg'
    },
    {
        'text': 'Еще один необычный музей, посвященный истории Иркутского тюремного замка, расположен в историческом '
                'здании СИЗО No1. Учреждение было основано свыше 210 лет назад.',
        'image': 'images/prison_museum.jpg'
    },
    {
        'text': 'В Иркутске разворачивается действие романа Жюля Верна «Михаил Строгов». Первое стихотворение о городе '
                'было написано в начале XIX века.',
        'image': 'images/strogov.jpg'
    },
    {
        'text': 'Единственная постройка, оставшаяся от первоначального острога Иркутска – Спасская церковь. Остальной '
                'Кремль был разобран в конце XVIII века.',
        'image': 'images/spasskaya.jpg'
    },
    {
        'text': 'Этот город долгое время был местом ссылки для политических преступников. В частности, туда сослали '
                'участников Восстания декабристов, в честь которых здесь впоследствии был открыт музей.',
        'image': 'images/dekabristy.jpg'
    },
    {
        'text': 'Трамваи появились в Иркутске вскоре после войны, причем довольно долго этот вид транспорта был '
                'бесплатным.',
        'image': 'images/tram.jpg'
    },
    {
        'text': 'В 2018 году Иркутскому государственному университету исполнилось 200 лет.',
        'image': 'images/igu_200.jpg'
    },
    {
        'text': 'В Иркутске и смежной области насчитывается свыше 1000 памятников архитектуры, культуры и истории.',
        'image': 'images/monuments.jpg'
    },
    {
        'text': 'В 1863 году в Иркутске был открыт первый магазин товаров из Китая.',
        'image': 'images/china_shop.jpg'
    },
    {
        'text': 'В 1869 году в городе открыли первое заведение для детей в возрасте от 4 до 8 лет под названием '
                '«Детский сад».',
        'image': 'images/kindergarten.jpg'
    },
    {
        'text': 'Иркутск старше Санкт-Петербурга на 42 года. Санкт-Петербург был основан в 1703 году.',
        'image': 'images/piter_42.jpg'
    },
    {
        'text': 'Во время войны 1941-1945 годов в Иркутск эвакуировали несколько десятков предприятий. Также город '
                'стал местом, где лечили раненых бойцов — в столице Восточной Сибири открыли 26 госпиталей.',
        'image': 'images/hospital.jpg'
    },
    {
        'text': 'Улица Карла Маркса до 1920 года называлась Большая, Большая Прешпективная, Большая Перспективная, '
                'Большой проспект.',
        'image': 'images/marksa.jpg'
    },
    {
        'text': 'Летом 1883 года Иркутск пережил сильные проливные дожди. Уровень воды в Ангаре, Иркуте и Ушаковке '
                'поднялся настолько, что потоком снесло купальни, разрушило дамбу у кузниц, а часть мастерских '
                'оказалась под водой. Были размыты водосточные трубы, произошли обвалы.\nНа Мало-Блиновской улице '
                'вода залила дворы так глубоко, что губернатор, лично осмотрев место наводнения, распорядился '
                'доставить туда лодки для организации передвижения. Жители передвигались на лодках у всех на виду.',
        'image': 'images/boats.jpg'
    },
    {
        'text': '18 мая 1854 года в Иркутске открылся первый фотосалон. Стоимость одной фотокарточки составляла '
                '5–7 рублей — по тем временам сумма немалая. Для сравнения: пуд хлеба тогда стоил 1 рубль 40 копеек, '
                'а пуд мяса — 1 рубль 20 копеек.',
        'image': 'images/photo.jpg'
    },
{
        'text': 'С 1903 по 1930 годы в Иркутске действовал чудесный пассаж купцов Б. и М. Юцисов. Он находился '
                'на улице Пестеревской (сегодня — улица Урицкого) и напоминал уменьшенную копию московского ГУМа. '
                'Однако у иркутского пассажа была своя изюминка: с торцов галерея закрывалась витринами с ажурными '
                'стеклянными переплётами.\nВнутри располагались торговые лавки, склады, а также небольшие фонтаны. '
                'В 1908 году здесь открылся и электрический театр «Мираж».',
        'image': 'images/passag.jpg'
    },
    {
        'text': 'Иркутск — город на Великом чайном пути. Первый чайный магазин открылся в городе в апреле 1876 года, '
                'в старом большом гостином ряду. Владельцем магазина был Павел Андреевич Пономарев (купец 1-й '
                'гильдии, известный меценат).\nА к 1895 году в Иркутске уже работали 15 чайных магазинов с годовым '
                'оборотом в 920 тысяч рублей.',
        'image': 'images/tea_shop.jpg'
    },
    {
        'text': 'В 1933 году в Иркутске открылась чаеразвесочная фабрика, ставшая одной из крупнейших в стране. '
                'Уже в первый год работы предприятие выпустило 127 тонн байхового чая.\nВ 1950-е годы объём продукции '
                'фабрики достигал половины всего чая, производимого в СССР.',
        'image': 'images/tea_bag.jpg'
    },
    {
        'text': 'В 1933 году в Иркутске открылась чаеразвесочная фабрика, ставшая одной из крупнейших в стране. '
                'Уже в первый год работы предприятие выпустило 127 тонн байхового чая.\nВ 1950-е годы объём продукции '
                'фабрики достигал половины всего чая, производимого в СССР.',
        'image': 'images/tea_bag.jpg'
    }
]

print(len(facts))