facts = [
    {
        'text': '130-й квартал — специально созданная зона исторической застройки в центре Иркутска, где собраны '
                'архитектурные шедевры прошлого. С разных улиц города в одно место перенесли старинные здания и '
                'памятники деревянного зодчества XVIII-XIX веков, отреставрировали и дали им новую жизнь.\nЗдесь '
                'собрано 65 симпатичных домов с деревянным кружевом.\nСегодня 130-й квартал — одна из самых '
                'популярных точек притяжения в городе. Здесь находятся кузнечные и гончарные мастерские, сувенирные '
                'лавки и художественные галереи, кафе и рестораны, отели и культурные центры.',
        'image': 'images/kvartal130.jpg'
    },
    {
        'text': 'Иркутск — город в России, административный центр Иркутской области, образует отдельное '
                'муниципальное образование Иркутск со статусом городского округа как единственный '
                'населённый пункт в его составе.',
        'image': 'images/irkutsk.jpg'
    },
    {
        'text': 'Население города — 611 215 (2023) человек, шестой по численности населения город Сибири, '
                'двадцать пятый по численности населения город России.',
        'image': 'images/population.jpg'
    },
    {
        'text': 'Иркутск расположен в Восточной Сибири, на берегах реки Ангары, при впадении в неё реки Иркут, '
                'в 66 км от Байкала.',
        'image': 'images/map_location.jpg'
    },
    {
        'text': 'Иркутск — это крупный научно-образовательный центр, в котором обучается свыше ста тысяч студентов.',
        'image': 'images/students.jpg'
    },
    {
        'text': 'Иркустк — транспортный узел на Транссибирской железнодорожной магистрали и федеральных '
                'автомагистралях «Байкал» и «Сибирь».',
        'image': 'images/transsib.jpg'
    },
    {
        'text': 'Старинный сибирский город Иркутск основан как острог в 1661 году.',
        'image': 'images/ostrog.jpg'
    },
    {
        'text': 'Площадь у города Иркутска составляет 305 км2',
        'image': 'images/square_map.jpg'
    },
    {
        'text': 'Говорин Борис Александрович был первым мэром Иркутска.',
        'image': 'images/govorin.jpg'
    },
    {
        'text': 'Похабов Яков Иванович основал Иркутск в 1661 году.',
        'image': 'images/pohabov.jpg'
    },
    {
        'text': 'Иркутская область относится к самым солнечным регионам. В году 200-250 солнечных дней.',
        'image': 'images/sunny_days.jpg'
    },
    {
        'text': 'Герб Иркутска, утверждённый в 1997 году, представляет собой серебряный геральдический щит, '
                'на котором изображён чёрный «бабр» с червлёными глазами, держащий в пасти червлёного соболя',
        'image': 'images/coat_of_arms.jpg'
    },
    {
        'text': 'Первое каменное здание — приказная изба появилась в 1701 году.',
        'image': 'images/prikaznaya_izba.jpg'
    },
    {
        'text': 'В 1764 году образована Иркутская губерния в составе Сибирского царства',
        'image': 'images/guberniya.jpg'
    },
    {
        'text': 'В 2020 году городу было присвоено звание «Город трудовой доблести».',
        'image': 'images/labor_valor.jpg'
    },
    {
        'text': 'Город Иркутск — важный административный, экономический, транспортный, научный и культурный '
                'центр Восточной Сибири, областной центр Иркутской области',
        'image': 'images/city_center.jpg'
    },
    {
        'text': 'В июне 1879 года город сильно пострадал от пожаров: выгорела почти вся его центральная часть, '
                'было уничтожено более двух третей городских построек, 75 кварталов. Однако Иркутск сравнительно '
                'быстро восстановился, приобретя новый, более современный вид.',
        'image': 'images/fire_1879.jpg'
    },
    {
        'text': 'Знаменский собор монастыря построен в 1757-1762 годах в традициях иркутской школы сибирского барокко. '
                'К основному храму примыкают обширная трапезная и восьмигранная колокольня.',
        'image': 'images/znamensky.jpg'
    },
    {
        'text': 'До 1932 года в Иркутске находился главный храм — Казанский собор, построенный в византийском стиле. '
                'Собор был заложен в 1875 году, строительные работы велись в течение многих лет и были закончены '
                'в 1895 году.\nИркутский кафедральный собор входил в число крупнейших культовых сооружений России. '
                'Он вмещал 5 000 человек, его высота достигала 60 метров. Архитектурные достоинства храма высоко '
                'оценивались современниками.\nВ 1932 году здание Казанского собора было взорвано.',
        'image': 'images/kazansky.jpg'
    },
    {
        'text': 'Иркутский областной художественный музей — один из крупнейших в регионе. Основу его собрания '
                'составила коллекция картин, икон и других произведений искусства, подаренных городу иркутским купцом, '
                'городским головой Сукачевым.\nДо 1917 года в этом здании находилась Иркутская мужская гимназия, '
                'основанная в 1805 году.',
        'image': 'images/art_museum.jpg'
    },
    {
        'text': 'До революции Иркутск часто называли «Сибирскими Афинами», «Восточным Парижем» и «Петербургом Сибири».',
        'image': 'images/paris.jpg'
    },
    {
        'text': 'Первоначально Транссибирскую магистраль предполагалось проложить по более короткому пути к северу от '
                'Байкала, однако Иркутску повезло, и в 1898 году туда прибыл первый поезд.',
        'image': 'images/train_arrival.jpg'
    },
    {
        'text': 'Еще один необычный музей, посвященный истории Иркутского тюремного замка, расположен в историческом '
                'здании СИЗО No1. Учреждение было основано свыше 210 лет назад.',
        'image': 'images/prison_museum.jpg'
    },
    {
        'text': 'Единственная постройка, оставшаяся от первоначального острога Иркутска – Спасская церковь. Остальной '
                'Кремль был разобран в конце XVIII века.',
        'image': 'images/spasskaya.jpg'
    },
    {
        'text': 'Этот город долгое время был местом ссылки для политических преступников. В частности, туда сослали '
                'участников Восстания декабристов, в честь которых здесь впоследствии был открыт музей.',
        'image': 'images/dekabristy.jpg'
    },
    {
        'text': 'Трамваи появились в Иркутске вскоре после войны, причем довольно долго этот вид транспорта был '
                'бесплатным.',
        'image': 'images/tram.jpg'
    },
    {
        'text': 'В 2018 году Иркутскому государственному университету исполнилось 200 лет.',
        'image': 'images/igu_200.jpg'
    },
    {
        'text': 'В Иркутске и смежной области насчитывается свыше 1000 памятников архитектуры, культуры и истории.',
        'image': 'images/monuments.jpg'
    },
    {
        'text': 'В 1863 году в Иркутске был открыт первый магазин товаров из Китая.',
        'image': 'images/china_shop.jpg'
    },
    {
        'text': 'В 1869 году в городе открыли первое заведение для детей в возрасте от 4 до 8 лет под названием '
                '«Детский сад».',
        'image': 'images/kindergarten.jpg'
    },
    {
        'text': 'Иркутск старше Санкт-Петербурга на 42 года. Санкт-Петербург был основан в 1703 году.',
        'image': 'images/piter_42.jpg'
    },
    {
        'text': 'Во время войны 1941-1945 годов в Иркутск эвакуировали несколько десятков предприятий. Также город '
                'стал местом, где лечили раненых бойцов — в столице Восточной Сибири открыли 26 госпиталей.',
        'image': 'images/hospital.jpg'
    },
    {
        'text': 'Улица Карла Маркса до 1920 года называлась Большая, Большая Прешпективная, Большая Перспективная, '
                'Большой проспект.',
        'image': 'images/marksa.jpg'
    },
    {
        'text': 'Летом 1883 года Иркутск пережил сильные проливные дожди. Уровень воды в Ангаре, Иркуте и Ушаковке '
                'поднялся настолько, что потоком снесло купальни, разрушило дамбу у кузниц, а часть мастерских '
                'оказалась под водой. Были размыты водосточные трубы, произошли обвалы.\nНа Мало-Блиновской улице '
                'вода залила дворы так глубоко, что губернатор, лично осмотрев место наводнения, распорядился '
                'доставить туда лодки для организации передвижения. Жители передвигались на лодках у всех на виду.',
        'image': 'images/boats.jpg'
    },
    {
        'text': '18 мая 1854 года в Иркутске открылся первый фотосалон. Стоимость одной фотокарточки составляла '
                '5–7 рублей — по тем временам сумма немалая. Для сравнения: пуд хлеба тогда стоил 1 рубль 40 копеек, '
                'а пуд мяса — 1 рубль 20 копеек.',
        'image': 'images/photo.jpg'
    },
{
        'text': 'С 1903 по 1930 годы в Иркутске действовал чудесный пассаж купцов Б. и М. Юцисов. Он находился '
                'на улице Пестеревской (сегодня — улица Урицкого) и напоминал уменьшенную копию московского ГУМа. '
                'Однако у иркутского пассажа была своя изюминка: с торцов галерея закрывалась витринами с ажурными '
                'стеклянными переплётами.\nВнутри располагались торговые лавки, склады, а также небольшие фонтаны. '
                'В 1908 году здесь открылся и электрический театр «Мираж».',
        'image': 'images/passag.jpg'
    },
    {
        'text': 'Иркутск — город на Великом чайном пути. Первый чайный магазин открылся в городе в апреле 1876 года, '
                'в старом большом гостином ряду. Владельцем магазина был Павел Андреевич Пономарев (купец 1-й '
                'гильдии, известный меценат).\nА к 1895 году в Иркутске уже работали 15 чайных магазинов с годовым '
                'оборотом в 920 тысяч рублей.',
        'image': 'images/tea_shop.jpg'
    },
    {
        'text': 'В 1933 году в Иркутске открылась чаеразвесочная фабрика, ставшая одной из крупнейших в стране. '
                'Уже в первый год работы предприятие выпустило 127 тонн байхового чая.\nВ 1950-е годы объём продукции '
                'фабрики достигал половины всего чая, производимого в СССР.',
        'image': 'images/tea_bag.jpg'
    },
    {
        'text': 'В Иркутской области насчитывается почти 900 населенных пунктов, где проживает около 2 миллионов '
                '400 тысяч человек. Для понимания, это на полмиллиона человек больше, чем живёт во всей Латвии.',
        'image': 'images/listvyanka.jpg'
    },
    {
        'text': '19 октября 1764 году, согласно высочайшему указу императрицы Екатерины II, Сибирь именуется Сибирским '
                'царством на территории которого учреждаются две самостоятельные губернии: Тобольская и Иркутская.',
        'image': 'images/ekaterina2.jpg'
    },
    {
        'text': 'Нынешний иркутский аэропорт работает с 1933 года, статус международного получил ещё в 1954 году. '
                'Он расположен в черте города, всего в 5 км от центра, совсем рядом с жилыми кварталами.\nВ Иркутске '
                'есть ещё один аэродром - у авиационного завода.\nТот факт, что оба аэропорта вплотную окружены жилыми '
                'и хозяйственными постройками, сыграл с городом злую шутку. В период с 1952 по 2006 год в городе и '
                'вблизи него произошло свыше 20 авиакатастроф, за что Иркутск обрёл славу «города падающих '
                'самолётов».\nСреди крупных происшествий — катастрофа грузового самолёта Ан-124, упавшего на жилые '
                'дома в 1997 году, и пассажирского самолёта А-310, пробившего бетонное ограждение во время посадки '
                'в 2006 году.',
        'image': 'images/ruslan.jpg'
    },
    {
        'text': 'Иркутск является антиподом чилийского города Пунта-Аренас, то есть эти города расположены на '
                'диаметрально противоположных точках земного шара.',
        'image': 'images/arenas.jpg'
    },
    {
        'text': 'Иркутск расположен в сейсмически активной зоне. Территория области входит в Монголо-Байкальский '
                'пояс активного проявления подземных толчков, где каждые три часа фиксируется одно землетрясение. '
                'Совсем несильные, но всё же, к счастью, сильных землетрясений тут не бывает и за более чем 360-летнюю '
                'историю города по этой причине никто не погиб.\nВ среднем в Иркутске ежегодно регистрируется 304 '
                'землетрясения интенсивностью до 4 баллов, а землетрясения интенсивностью 6 баллов происходят один '
                'раз в 15 лет.\nКстати, обычно эпицентр землетрясений находится в районе озера Байкал.',
        'image': 'images/earthquake.jpg'
    },
    {
        'text': 'Иркутский планетарий один из самых современных планетариев в России. В главном зале, имеющим купол '
                'диаметром более 9 метров, можно посмотреть фильмы о космосе с эффектом присутствия.\nВ этом же '
                'комплексе есть обсерватория с телескопом, музей «Ноосфера» и выставка оптических иллюзий.',
        'image': 'images/noosphera.jpg'
    },
    {
        'text': 'В Иркутске разворачиваются основные события романа Жюля Верна «Михаил Строгов». Автор называет город '
                '«огромной кладовой разных товаров, которыми торгует Китай, вся Центральная Азия и Европа».',
        'image': 'images/strogov.jpg'
    },
    {
        'text': '17 марта 1938 года в поезде, следующим во Владивосток, где-то на перегоне между Иркутском и '
                'Слюдянкой, появился на свет знаменитый артист балета Рудольф Нуриев. В 1961 году по окончанию '
                'гастролей в Париже он попросил политического убежища, став одним из самых известных «невозвращенцев» '
                'СССР.',
        'image': 'images/nuriev.jpg'
    },
    {
        'text': 'В Иркутске родились сразу два авиаконструктора – создатели вертолётов Н.И. Камов и М.Л. Миль',
        'image': 'images/kamov.jpg'
    },
    {
        'text': 'В Иркутской области родился конструктор ракет Михаил Янгель.',
        'image': 'images/yangel.jpg'
    },
    {
        'text': 'В Иркутске в молодости жил известный кинематографист Леонид Гайдай.',
        'image': 'images/leonid.jpg'
    },
    {
        'text': 'В 1893 году в Иркутске открылся первый, как сказали бы сейчас, спортивный комплекс. Был построен '
                'циклодром - велосипедный трек, а также площадки для крокета, кеглей, гигантских шагов и занятий '
                'гимнастикой. Кстати, в городе к этому времени было уже свыше сотни двухколесных транспортных '
                'средств.\nВ советское время на этом месте был построен стадион «Локомотив».',
        'image': 'images/cyclodrom.jpg'
    },
    {
        'text': 'Крестовоздвиженская церковь - это единственный храм в Сибири, где полностью сохранились интерьеры '
                'XVIII века. Здание построено в стиле «сибирское барокко», в котором сочетаются и западные, и '
                'восточные мотивы, и украшено бурятскими и монгольскими орнаментами.',
        'image': 'images/sobor.jpg'
    },
    {
        'text': 'Иркутск – один из немногих городов России, где была осознана ценность исторического деревянного '
                'наследия.',
        'image': 'images/derevo.jpg'
    }
]

# print(len(facts))
