facts = [
    'Иркутск — город в России, административный центр Иркутской области, образует отдельное муниципальное образование '
    'Иркутск со статусом городского округа как единственный населённый пункт в его составе.',
    'Население города — 611 215 (2023) человек, шестой по численности населения город Сибири, двадцать пятый '
    'по численности населения город России.',
    'Иркутск расположен в Восточной Сибири, на берегах реки Ангары, при впадении в неё реки Иркут, в 66 км от Байкала.',
    'Иркутск — это крупный научно-образовательный центр, в котором обучается свыше ста тысяч студентов.',
    'Иркустк — транспортный узел на Транссибирской железнодорожной магистрали и федеральных автомагистралях «Байкал» и '
    '«Сибирь».',
    'Старинный сибирский город Иркутск основан как острог в 1661 году.',
    'Площадь у города Иркутска составляет 305 км2',
    'Говорин Борис Александрович был первым мэром Иркутска.',
    'Похабов Яков Иванович основал Иркутск в 1661 году.',
    'Иркутская область относится к самым солнечным регионам. В году 200-250 солнечных дней.',
    'Герб Иркутска, утверждённый в 1997 году, представляет собой серебряный геральдический щит, на котором изображён '
    'чёрный «бабр» с червлёными глазами, держащий в пасти червлёного соболя',
    'Первое каменное здание — приказная изба появилась в 1701 году.',
    'В 1764 году образована Иркутская губерния в составе Сибирского царства',
    'В 2020 году городу было присвоено звание «Город трудовой доблести».',
    'Город Иркутск — важный административный, экономический, транспортный, научный и культурный центр Восточной '
    'Сибири, областной центр Иркутской области',
    'В июне 1879 года город сильно пострадал от пожаров: выгорела почти вся его центральная часть, было уничтожено '
    'более двух третей городских построек, 75 кварталов. Однако Иркутск сравнительно быстро восстановился, приобретя '
    'новый, более современный вид.',
    'Знаменский собор монастыря построен в 1757-1762 годах в традициях иркутской школы сибирского барокко. К основному '
    'храму примыкают обширная трапезная и восьмигранная колокольня.',
    'До 1932 года в Иркутске находился главный храм — Казанский собор, построенный в византийском стиле. Собор был '
    'заложен в 1875 году, строительные работы велись в течение многих лет и были закончены в 1895 году. Иркутский '
    'кафедральный собор входил в число крупнейших культовых сооружений России. Он вмещал 5 000 человек, его высота '
    'достигала 60 метров. Архитектурные достоинства храма высоко оценивались современниками. В 1932 году здание '
    'Казанского собора было взорвано.',
    'Иркутский областной художественный музей — один из крупнейших в регионе. Основу его собрания составила коллекция '
    'картин, икон и других произведений искусства, подаренных городу иркутским купцом, городским головой Сукачевым. '
    'До 1917 года в этом здании находилась Иркутская мужская гимназия, основанная в 1805 году.',
    'До революции Иркутск часто называли «Сибирскими Афинами», «Восточным Парижем» и «Петербургом Сибири».',
    'Первоначально Транссибирскую магистраль предполагалось проложить по более короткому пути к северу от Байкала, '
    'однако Иркутску повезло, и в 1898 году туда прибыл первый поезд.',
    'Еще один необычный музей, посвященный истории Иркутского тюремного замка, расположен в историческом здании СИЗО '
    'No1. Учреждение было основано свыше 210 лет назад.',
    'В Иркутске разворачивается действие романа Жюля Верна «Михаил Строгов». Первое стихотворение о городе было '
    'написано в начале XIX века.',
    'Единственная постройка, оставшаяся от первоначального острога Иркутска – Спасская церковь. Остальной Кремль был '
    'разобран в конце XVIII века.',
    'Этот город долгое время был местом ссылки для политических преступников. В частности, туда сослали участников '
    'Восстания декабристов, в честь которых здесь впоследствии был открыт музей.',
    'Трамваи появились в Иркутске вскоре после войны, причем довольно долго этот вид транспорта был бесплатным.',
    'В 2018 году Иркутскому государственному университету исполнилось 200 лет.',
    'В Иркутске и смежной области насчитывается свыше 1000 памятников архитектуры, культуры и истории.',
    'В 1863 году в Иркутске был открыт первый магазин товаров из Китая.',
    'В 1869 году в городе открыли первое заведение для детей в возрасте от 4 до 8 лет под названием «Детский сад».',
    'Иркутск старше Санкт-Петербурга на 42 года. Санкт-Петербург был основан в 1703 году.',
    'Во время войны 1941-1945 годов в Иркутск эвакуировали несколько десятков предприятий. Также город стал местом, '
    'где лечили раненых бойцов — в столице Восточной Сибири открыли 26 госпиталей.',
    'Улица Карла Маркса до 1920 года называлась Большая, Большая Прешпективная, Большая Перспективная, Большой '
    'проспект.'
]
